NguyenVanHung1707/smart-home-iot-agent/src/firmware/esp32_xiaozhi_gateway/esp32_xiaozhi_gateway.ino
/*
 * ============================================================================
 * DỰ ÁN SMART HOME (HOMING SERVERLESS)
 * ESP32 #3: XIAOZHI MASTER GATEWAY (CẦU NỐI CLOUD MQTT & ESP-NOW & I2S AUDIO)
 * ============================================================================
 * Thiết bị trung tâm đóng 3 vai trò:
 * 1. Loa thông minh AI Xiaozhi:
 *    - Micro I2S INMP441 (Thu âm giọng nói, nhận diện VAD)
 *    - Khuếch đại I2S MAX98357A + Loa 3W (Phát nhạc, âm báo, giọng phản hồi
 * TTS)
 * 2. Smart Gateway:
 *    - Kết nối WiFi Internet với HiveMQ Cloud qua TLS (Port 8883)
 *    - Nhận lệnh từ Web Dashboard và Giọng nói -> Phát sóng ESP-NOW sang ESP #1
 * & #2
 *    - Nhận Telemetry cảm biến từ ESP #1 & #2 -> Bắn MQTT lên Web Dashboard
 * 3. Trung tâm Báo động An ninh:
 *    - Tự động hú còi báo động cục bộ qua Loa 3W khi nhận gói ALERT từ ESP-NOW
 * ============================================================================
 */

#include <ArduinoJson.h>
#include <HTTPClient.h>
#include <PubSubClient.h>
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <driver/i2s.h>
#include <esp_now.h>
#include <math.h>
#include <Wire.h>
#include <U8g2lib.h>

// ============================================================================
// CẤU HÌNH PHẦN CỨNG: CHỌN LOẠI BOARD ESP32
// ============================================================================
// Mặc định chọn ESP32 Classic (WROOM-32 / NodeMCU 30 & 38 chân).
// Nếu bạn dùng ESP32-S3, hãy comment dòng BOARD_ESP32_CLASSIC và mở comment
// dòng BOARD_ESP32_S3.
#define BOARD_ESP32_CLASSIC
// #define BOARD_ESP32_S3

#if defined(BOARD_ESP32_CLASSIC)
// --- Pinout ESP32 Classic (WROOM-32) ---
// 1. Màn hình OLED 1.3 inch I2C (SH1106 128x64)
#define OLED_SDA 21 // Chân SDA của màn hình OLED
#define OLED_SCL 22 // Chân SCL của màn hình OLED

// 2. Mạch khuếch đại MAX98357A (Loa 3W) - I2S_NUM_0 (TX)
#define I2S_SPK_BCLK 26 // Bit Clock
#define I2S_SPK_LRC 25  // Left/Right Word Select Clock
#define I2S_SPK_DIN 27  // Serial Data Output sang DIN MAX98357A (chuyển sang 27 để nhường chân 21 & 22 cho OLED I2C)

// 3. Micro I2S INMP441 - I2S_NUM_1 (RX)
#define I2S_MIC_SCK 14 // Serial Clock thu âm
#define I2S_MIC_WS 15  // Word Select thu âm
#define I2S_MIC_SD 32  // Serial Data Input (từ SD của INMP441 vào ESP32)
#elif defined(BOARD_ESP32_S3)
// --- Pinout ESP32-S3 (Chuẩn board bread-compact-wifi của Xiaozhi) ---
#define OLED_SDA 17
#define OLED_SCL 18

#define I2S_SPK_BCLK 15
#define I2S_SPK_LRC 16
#define I2S_SPK_DIN 7

#define I2S_MIC_SCK 5
#define I2S_MIC_WS 4
#define I2S_MIC_SD 6
#endif

// ============================================================================
// CẤU HÌNH MÀN HÌNH OLED 1.3 INCH I2C (SH1106 / SSD1306)
// ============================================================================
// Đa số màn hình OLED 1.3" I2C dùng driver SH1106 (128x64).
// Nếu màn hình của bạn là SSD1306 (hoặc OLED 0.96"), hãy comment dòng SH1106
// và mở comment dòng SSD1306 bên dưới:
#define OLED_DRIVER_SH1106
// #define OLED_DRIVER_SSD1306

#if defined(OLED_DRIVER_SH1106)
U8G2_SH1106_128X64_NONAME_F_HW_I2C u8g2(U8G2_R0, /* reset=*/ U8X8_PIN_NONE);
#elif defined(OLED_DRIVER_SSD1306)
U8G2_SSD1306_128X64_NONAME_F_HW_I2C u8g2(U8G2_R0, /* reset=*/ U8X8_PIN_NONE);
#endif

// Cấu hình cổng I2S
#define I2S_SPK_PORT I2S_NUM_0
#define I2S_MIC_PORT I2S_NUM_1
#define AUDIO_SAMPLE_RATE 16000

// Ngưỡng năng lượng nhận diện giọng nói (Voice Activity Detection - VAD)
#define VAD_THRESHOLD 500

// Cờ trạng thái âm thanh
volatile bool isSpeakerPlaying = false;

// ============================================================================
// THÔNG TIN MẠNG VÀ CLOUD MQTT
// ============================================================================
const char *wifi_ssid = "TP-Link_ED49";
const char *wifi_pass = "76664748";

// Thông tin Cloud MQTT (HiveMQ Cloud Cluster TLS Port 8883)
const char *mqtt_server = "6c4c02ddd3b74d6e8f5c86d3ab2e7059.s1.eu.hivemq.cloud";
const int mqtt_port = 8883;
const char *mqtt_user = "espxiaozhiai";
const char *mqtt_pass = "12345678";

// Địa chỉ MAC của 2 con ESP32 Slaves
uint8_t mac_esp1_appliances[] = {0x78, 0x1C, 0x3C, 0xF5, 0x85, 0x84}; // MAC ESP32 #1 (Thiết bị thực tế)
uint8_t mac_esp2_entrance[] = {0x00, 0x4B, 0x12, 0x3E, 0x4F, 0xC8}; // MAC ESP32 #2 (Cổng thực tế)

#define WIFI_CHANNEL 2

// Cấu trúc gói tin ESP-NOW đồng bộ 3 con ESP
typedef struct struct_message {
  char msg_type[10];  // "CMD", "STATE", "ALERT"
  char device_id[32]; // "living-light", "entry-lock", v.v.
  char action[16];    // "turn_on", "unlock", v.v.
  int value;          // 0 hoặc 1
  float float_val;    // nhiệt độ, gas, v.v.
} struct_message;

struct_message outgoingCmd;
struct_message incomingData;

esp_now_peer_info_t peer1;
esp_now_peer_info_t peer2;

WiFiClientSecure secureClient;
PubSubClient mqttClient(secureClient);

unsigned long lastMqttRetry = 0;
unsigned long lastHeartbeat = 0;

// Task handle cho Micro
TaskHandle_t micTaskHandle = NULL;

// ============================================================================
// QUẢN LÝ GIAO DIỆN MÀN HÌNH OLED 1.3 INCH I2C & MÃ LIÊN KẾT BOT 6 CHỮ SỐ
// ============================================================================
char oledEventStr[32] = "Khoi dong he thong...";
volatile bool oledNeedsUpdate = true;
bool oledAlertMode = false;
char alertDevice[32] = "";
char alertAction[32] = "";
unsigned long alertStartTime = 0;

// Mã liên kết 6 chữ số với Bot Xiaozhi (lấy tự động từ Xiaozhi Cloud hoặc sinh từ MAC)
String xiaozhiBindCode = "";

void setOledEvent(const char *evt) {
  strncpy(oledEventStr, evt, sizeof(oledEventStr) - 1);
  oledEventStr[sizeof(oledEventStr) - 1] = '\0';
  oledNeedsUpdate = true;
}

void renderOledDashboard() {
  u8g2.clearBuffer();

  if (oledAlertMode) {
    // Giao diện cảnh báo an ninh khẩn cấp (Inverted Header)
    u8g2.drawBox(0, 0, 128, 16);
    u8g2.setDrawColor(0);
    u8g2.setFont(u8g2_font_7x14B_tf);
    u8g2.drawStr(12, 13, "! CANH BAO !");

    u8g2.setDrawColor(1);
    u8g2.setFont(u8g2_font_6x10_tf);
    char devLine[32];
    snprintf(devLine, sizeof(devLine), "TB: %s", alertDevice);
    u8g2.drawStr(2, 31, devLine);

    char actLine[32];
    snprintf(actLine, sizeof(actLine), "TT: %s", alertAction);
    u8g2.drawStr(2, 45, actLine);

