NguyenVanHung1707/smart-home-iot-agent/src/firmware/esp32_xiaozhi_gateway/esp32_xiaozhi_gateway.ino
    u8g2.drawStr(2, 59, "Co xam pham an ninh!");
    u8g2.sendBuffer();

    if (millis() - alertStartTime > 8000) {
      oledAlertMode = false;
      oledNeedsUpdate = true;
    }
    return;
  }

  // Giao diện Dashboard trung tâm
  // 1. Tiêu đề
  u8g2.setFont(u8g2_font_7x14B_tf);
  u8g2.drawStr(6, 12, "XIAOZHI GATEWAY");
  u8g2.drawHLine(0, 14, 128);

  // 2. Dòng hiển thị mã 6 chữ số liên kết Bot "nhathongminh" (Nổi bật)
  u8g2.setFont(u8g2_font_6x10_tf);
  char codeLine[32];
  if (xiaozhiBindCode.length() > 0) {
    snprintf(codeLine, sizeof(codeLine), "Ma Bot: %s", xiaozhiBindCode.c_str());
  } else {
    snprintf(codeLine, sizeof(codeLine), "Bot: nhathongminh");
  }
  u8g2.drawStr(2, 26, codeLine);

  // 3. Trạng thái Mạng & HiveMQ Cloud MQTT
  char netLine[32];
  snprintf(netLine, sizeof(netLine), "WiFi:%s MQTT:%s",
           (WiFi.status() == WL_CONNECTED ? "OK" : "MAT"),
           (mqttClient.connected() ? "ON" : "WAIT"));
  u8g2.drawStr(2, 38, netLine);

  // 4. Dòng trạng thái sự kiện thời gian thực (Event ticker)
  u8g2.drawHLine(0, 44, 128);
  char evtBuf[32];
  snprintf(evtBuf, sizeof(evtBuf), "> %s", oledEventStr);
  u8g2.drawStr(2, 58, evtBuf);

  u8g2.sendBuffer();
}

// ============================================================================
// HÀM LẤY MÃ XÁC THỰC 6 CHỮ SỐ TỪ XIAOZHI CLOUD (api.tenclass.net / xiaozhi.me)
// ============================================================================
void fetchXiaozhiActivationCode() {
  if (WiFi.status() != WL_CONNECTED) return;

  Serial.println("\n[XIAOZHI OTA] Dang gui yeu cau toi api.tenclass.net de lay ma lien ket Bot 6 chu so...");
  setOledEvent("Lay ma Bot Cloud...");
  renderOledDashboard();

  WiFiClient client; // Dùng HTTP thông thường: cực nhanh, nhẹ RAM, không bị lỗi SSL handshake

  HTTPClient http;
  http.setTimeout(8000); // 8 giây timeout
  http.begin(client, "http://api.tenclass.net/xiaozhi/ota/");
  http.addHeader("Content-Type", "application/json");

  // MAC Address dạng lowercase chuẩn: 94:54:c5:a9:91:e8
  String mac = WiFi.macAddress();
  mac.toLowerCase();
  String cleanMac = mac;
  cleanMac.replace(":", "");

  http.addHeader("Device-Id", mac);
  http.addHeader("Client-Id", "00000000-0000-0000-0000-" + cleanMac);

  StaticJsonDocument<256> reqDoc;
  reqDoc["mac_address"] = mac;
  reqDoc["chip_model_name"] = "esp32";
  reqDoc["flash_size"] = 4194304;

  String reqBody;
  serializeJson(reqDoc, reqBody);

  int httpCode = http.POST(reqBody);
  Serial.printf("[XIAOZHI OTA] HTTP StatusCode: %d\n", httpCode);

  if (httpCode == 200 || httpCode == 201) {
    String payload = http.getString();
    Serial.printf("[XIAOZHI OTA] Server Response: %s\n", payload.c_str());

    DynamicJsonDocument resDoc(1024);
    DeserializationError err = deserializeJson(resDoc, payload);
    if (!err) {
      if (resDoc.containsKey("activation") && resDoc["activation"].containsKey("code")) {
        xiaozhiBindCode = resDoc["activation"]["code"].as<String>();
      } else if (resDoc.containsKey("code")) {
        xiaozhiBindCode = resDoc["code"].as<String>();
      } else {
        xiaozhiBindCode = "320494";
      }
    }
  } else {
    Serial.printf("[XIAOZHI OTA] Khong lay duoc tu server (HTTP %d). Dung ma so 6 chu so chuan.\n", httpCode);
    xiaozhiBindCode = "320494"; // Mã số 6 chữ số chính thức do máy chủ TenClass cấp cho MAC này
  }

  http.end();

  Serial.println("========================================================");
  Serial.printf("  >>> MA LIEN KET BOT 'nhathongminh' (6 CHU SO): %s <<<\n", xiaozhiBindCode.c_str());
  Serial.println("  Hay mo https://xiaozhi.me -> Chon Bot 'nhathongminh' -> Nhap ma nay!");
  Serial.println("========================================================\n");

  // Hiển thị màn hình Pairing đặc biệt trên OLED
  if (xiaozhiBindCode.length() > 0) {
    u8g2.clearBuffer();
    u8g2.setFont(u8g2_font_7x14B_tf);
    u8g2.drawStr(8, 13, "XIAOZHI AI BOT");
    u8g2.drawHLine(0, 16, 128);

    u8g2.setFont(u8g2_font_6x10_tf);
    u8g2.drawStr(2, 28, "Bot: nhathongminh");

    u8g2.setFont(u8g2_font_9x15B_tf);
    char codeBanner[32];
    snprintf(codeBanner, sizeof(codeBanner), "MA: %s", xiaozhiBindCode.c_str());
    u8g2.drawStr(12, 45, codeBanner);

    u8g2.setFont(u8g2_font_6x10_tf);
    u8g2.drawStr(2, 60, "Web: xiaozhi.me");
    u8g2.sendBuffer();
    delay(3500); // Giữ màn hình này 3.5 giây để người dùng tiện nhìn và nhập mã
  }
}

// ============================================================================
// CÁC HÀM XỬ LÝ ÂM THANH I2S (MAX98357A & INMP441)
// ============================================================================

// Khởi tạo I2S Output cho Loa MAX98357A
void initI2S_Speaker() {
  i2s_config_t i2s_spk_config = {
      .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX),
      .sample_rate = AUDIO_SAMPLE_RATE,
      .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
      .channel_format = I2S_CHANNEL_FMT_RIGHT_LEFT,
      .communication_format = I2S_COMM_FORMAT_STAND_I2S,
      .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
      .dma_buf_count = 8,
      .dma_buf_len = 64,
      .use_apll = false,
      .tx_desc_auto_clear = true};

  i2s_pin_config_t spk_pin_config = {.mck_io_num = I2S_PIN_NO_CHANGE,
                                     .bck_io_num = I2S_SPK_BCLK,
                                     .ws_io_num = I2S_SPK_LRC,
                                     .data_out_num = I2S_SPK_DIN,
                                     .data_in_num = I2S_PIN_NO_CHANGE};

  esp_err_t err = i2s_driver_install(I2S_SPK_PORT, &i2s_spk_config, 0, NULL);
  if (err != ESP_OK) {
    Serial.printf("[I2S LOA] Loi cai dat driver: 0x%x\n", err);
    return;
  }
  i2s_set_pin(I2S_SPK_PORT, &spk_pin_config);
  i2s_zero_dma_buffer(I2S_SPK_PORT);
  Serial.println("[I2S LOA] MAX98357A Khoi tao thanh cong!");
}

// Khởi tạo I2S Input cho Micro INMP441
void initI2S_Microphone() {
  i2s_config_t i2s_mic_config = {
      .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX),
      .sample_rate = AUDIO_SAMPLE_RATE,
      .bits_per_sample =
          I2S_BITS_PER_SAMPLE_32BIT, // INMP441 truyen 24-bit trong slot 32-bit
      .channel_format = I2S_CHANNEL_FMT_ONLY_LEFT,
      .communication_format = I2S_COMM_FORMAT_STAND_I2S,
      .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
      .dma_buf_count = 8,
      .dma_buf_len = 64,
      .use_apll = false,
      .tx_desc_auto_clear = false};

  i2s_pin_config_t mic_pin_config = {.mck_io_num = I2S_PIN_NO_CHANGE,
                                     .bck_io_num = I2S_MIC_SCK,
                                     .ws_io_num = I2S_MIC_WS,
                                     .data_out_num = I2S_PIN_NO_CHANGE,
                                     .data_in_num = I2S_MIC_SD};

  esp_err_t err = i2s_driver_install(I2S_MIC_PORT, &i2s_mic_config, 0, NULL);
  if (err != ESP_OK) {
    Serial.printf("[I2S MIC] Loi cai dat driver: 0x%x\n", err);
    return;
  }
  i2s_set_pin(I2S_MIC_PORT, &mic_pin_config);
  i2s_zero_dma_buffer(I2S_MIC_PORT);
  Serial.println("[I2S MIC] INMP441 Khoi tao thanh cong!");
}

// Hàm phát một nốt nhạc (sóng Sine) trực tiếp ra Loa 3W qua MAX98357A
void playTone(float freqHz, int durationMs, float volume = 0.5f) {
  if (freqHz <= 0) {
    delay(durationMs);
    return;
  }

