NguyenVanHung1707/smart-home-iot-agent/src/firmware/esp32_xiaozhi_gateway/esp32_xiaozhi_gateway.ino
  isSpeakerPlaying = true;
  int totalSamples = (AUDIO_SAMPLE_RATE * durationMs) / 1000;
  int16_t buffer[128]; // Buffer stereo (L, R)
  size_t bytesWritten;

  float phase = 0.0f;
  float phaseIncrement = (2.0f * M_PI * freqHz) / (float)AUDIO_SAMPLE_RATE;
  int samplesGenerated = 0;

  while (samplesGenerated < totalSamples) {
    int chunk = min(64, totalSamples - samplesGenerated);
    for (int i = 0; i < chunk; i++) {
      int16_t sample = (int16_t)(sin(phase) * 32767.0f * volume);
      buffer[i * 2] = sample;     // Kênh Trái
      buffer[i * 2 + 1] = sample; // Kênh Phải
      phase += phaseIncrement;
      if (phase >= 2.0f * M_PI)
        phase -= 2.0f * M_PI;
    }

    i2s_write(I2S_SPK_PORT, buffer, chunk * 4, &bytesWritten, portMAX_DELAY);
    samplesGenerated += chunk;
  }

  i2s_zero_dma_buffer(I2S_SPK_PORT);
  isSpeakerPlaying = false;
}

// Hợp âm khởi động hệ thống (Test Loa ngay khi cắm nguồn)
void playBootChime() {
  Serial.println("[AUDIO] Phat am thanh khoi dong (Boot Chime)...");
  playTone(523.25f, 150, 0.4f); // C5 (Đô)
  delay(30);
  playTone(659.25f, 150, 0.4f); // E5 (Mi)
  delay(30);
  playTone(783.99f, 250, 0.4f); // G5 (Son)
}

// Âm thanh tiếng bíp xác nhận lệnh
void playBeep() { playTone(1000.0f, 80, 0.3f); }

// Âm thanh còi báo động khẩn cấp (An ninh / Gas / Cháy)
void playAlertAlarm() {
  Serial.println("[AUDIO] !!! KICH HOAT COI BAO DONG KHOI HE THONG !!!");
  for (int cycle = 0; cycle < 3; cycle++) {
    for (float f = 600.0f; f < 1400.0f; f += 40.0f) {
      playTone(f, 15, 0.6f);
    }
    for (float f = 1400.0f; f > 600.0f; f -= 40.0f) {
      playTone(f, 15, 0.6f);
    }
  }
}

// ============================================================================
// TASK THU ÂM TỪ MICRO INMP441 & VAD (VOICE ACTIVITY DETECTION)
// ============================================================================
void micAudioReaderTask(void *param) {
  const size_t bufferSize = 256;
  int32_t rawSamples[bufferSize];
  size_t bytesRead = 0;

  Serial.println("[TASK MIC] Bat dau luong giam sat am thanh INMP441...");

  while (true) {
    // Nếu loa đang phát âm thanh thì tạm dừng quét Mic để tránh dội tiếng
    // (Acoustic Echo)
    if (isSpeakerPlaying) {
      vTaskDelay(pdMS_TO_TICKS(50));
      continue;
    }

    esp_err_t res = i2s_read(I2S_MIC_PORT, rawSamples, sizeof(rawSamples),
                             &bytesRead, pdMS_TO_TICKS(100));
    if (res == ESP_OK && bytesRead > 0) {
      int numSamples = bytesRead / 4;
      int64_t sumSquares = 0;

      // Xử lý mẫu âm thanh 24-bit từ slot 32-bit của INMP441
      for (int i = 0; i < numSamples; i++) {
        int16_t sample16 = rawSamples[i] >> 14; // Chuyển đổi về 16-bit chuẩn
        sumSquares += (int32_t)sample16 * (int32_t)sample16;
      }

      int rms = (int)sqrt(sumSquares / numSamples);

      // In log định kỳ mỗi 2 giây để kiểm tra phần cứng Micro INMP441
      static unsigned long lastRmsPrint = 0;
      if (millis() - lastRmsPrint > 2000) {
        lastRmsPrint = millis();
        Serial.printf("[MIC TEST] RMS hien tai: %d (Nguong phat hien: %d)\n", rms, VAD_THRESHOLD);
      }

      // Nếu năng lượng vượt ngưỡng VAD -> Người dùng đang nói vào Micro!
      if (rms > VAD_THRESHOLD) {
        Serial.printf("[XIAOZHI MIC VAD] Phat hien giong noi! RMS: %d\n", rms);
        char micEvt[32];
        snprintf(micEvt, sizeof(micEvt), "Mic nghe: %d", rms);
        setOledEvent(micEvt);

        // Phát tiếng bíp ngắn phản hồi ngay lập tức để người dùng biết mạch đã nhận tiếng!
        playBeep();
        vTaskDelay(pdMS_TO_TICKS(500)); // Tránh spam trong cùng 1 câu nói
      }
    }

    vTaskDelay(pdMS_TO_TICKS(10));
  }
}

// ============================================================================
// GỬI LỆNH ESP-NOW SANG ESP32 #1 (THIẾT BỊ) HOẶC ESP32 #2 (CỔNG)
// ============================================================================
void dispatchCommandToEspNow(const char *deviceId, const char *action,
                             int val = 1) {
  strcpy(outgoingCmd.msg_type, "CMD");
  strncpy(outgoingCmd.device_id, deviceId, sizeof(outgoingCmd.device_id));
  strncpy(outgoingCmd.action, action, sizeof(outgoingCmd.action));
  outgoingCmd.value = val;
  outgoingCmd.float_val = 0;

  String dev = String(deviceId);

  if (dev.startsWith("entry-lock") || dev == "security-alarm") {
    // Thuộc về ESP32 #2 (Cổng)
    esp_err_t res = esp_now_send(mac_esp2_entrance, (uint8_t *)&outgoingCmd,
                                 sizeof(outgoingCmd));
    Serial.printf("[GATEWAY -> ESP2 CỔNG] %s -> %s (%s)\n", deviceId, action,
                  res == ESP_OK ? "OK" : "ERR");
  } else {
    // Thuộc về ESP32 #1 (Thiết bị trong nhà)
    esp_err_t res = esp_now_send(mac_esp1_appliances, (uint8_t *)&outgoingCmd,
                                 sizeof(outgoingCmd));
    Serial.printf("[GATEWAY -> ESP1 THIẾT BỊ] %s -> %s (%s)\n", deviceId,
                  action, res == ESP_OK ? "OK" : "ERR");
  }

  // Cập nhật trạng thái sự kiện lên màn hình OLED
  char cmdEvt[32];
  snprintf(cmdEvt, sizeof(cmdEvt), "CMD: %s", deviceId);
  setOledEvent(cmdEvt);

  // Phát bíp ngắn báo hiệu đã gửi lệnh thành công
  playBeep();
}

// ============================================================================
// CALLBACK KHI NHẬN TELEMETRY / SỰ KIỆN TỪ 2 CON ESP QUA ESP-NOW
// ============================================================================
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
void OnDataRecv(const esp_now_recv_info *recv_info, const uint8_t *incomingBytes, int len) {
  const uint8_t *mac = recv_info->src_addr;
#else
void OnDataRecv(const uint8_t *mac, const uint8_t *incomingBytes, int len) {
#endif
  memcpy(&incomingData, incomingBytes, sizeof(incomingData));

  Serial.printf("\n[GATEWAY NHẬN ESP-NOW] Type: %s | Device: %s | Action: %s | "
                "Val: %d | Float: %.1f\n",
                incomingData.msg_type, incomingData.device_id,
                incomingData.action, incomingData.value,
                incomingData.float_val);

  // NẾU CÓ CẢNH BÁO AN NINH / KHẨN CẤP -> HÚ CÒI BÁO ĐỘNG NGAY QUA LOA 3W & HIỂN THỊ OLED
  if (strcmp(incomingData.msg_type, "ALERT") == 0) {
    oledAlertMode = true;
    strncpy(alertDevice, incomingData.device_id, sizeof(alertDevice) - 1);
    alertDevice[sizeof(alertDevice) - 1] = '\0';
    strncpy(alertAction, incomingData.action, sizeof(alertAction) - 1);
    alertAction[sizeof(alertAction) - 1] = '\0';
    alertStartTime = millis();
    oledNeedsUpdate = true;
    playAlertAlarm();
  } else {
    char dataEvt[32];
    snprintf(dataEvt, sizeof(dataEvt), "%s: %s", incomingData.device_id, incomingData.action);
    setOledEvent(dataEvt);
  }

  if (!mqttClient.connected())
    return;

