NguyenVanHung1707/smart-home-iot-agent/src/firmware/esp32_xiaozhi_gateway/esp32_xiaozhi_gateway.ino
  // Đóng gói JSON đẩy lên Cloud MQTT để Web Dashboard cập nhật
  StaticJsonDocument<256> doc;
  doc["device_id"] = incomingData.device_id;
  doc["action"] = incomingData.action;
  doc["value"] = incomingData.value;
  doc["float_val"] = incomingData.float_val;
  doc["timestamp"] = millis();

  char buffer[256];
  serializeJson(doc, buffer);

  if (strcmp(incomingData.msg_type, "ALERT") == 0) {
    // Đẩy vào kênh an ninh khẩn cấp
    mqttClient.publish("homing/security/access_log", buffer);
    Serial.printf("[MQTT CLOUD ALERT] homing/security/access_log -> %s\n",
                  buffer);
  } else {
    // Cập nhật trạng thái thông thường
    String stateTopic =
        "homing/devices/" + String(incomingData.device_id) + "/state";
    mqttClient.publish(stateTopic.c_str(), buffer, true);
    Serial.printf("[MQTT CLOUD STATE] %s -> %s\n", stateTopic.c_str(), buffer);
  }
}

// ============================================================================
// CALLBACK NHẬN LỆNH TỪ WEB DASHBOARD QUA CLOUD MQTT (WSS / TLS)
// ============================================================================
void onMqttMessage(char *topic, byte *payload, unsigned int length) {
  char message[512];
  if (length >= sizeof(message))
    length = sizeof(message) - 1;
  memcpy(message, payload, length);
  message[length] = '\0';

  Serial.printf("\n[MQTT CLOUD NHẬN TỪ WEB] Topic: %s | Payload: %s\n", topic,
                message);

  String top = String(topic);

  // 1. Lệnh điều khiển thiết bị: homing/devices/{device_id}/command
  if (top.startsWith("homing/devices/") && top.endsWith("/command")) {
    int firstSlash = top.indexOf('/', 0);
    int secondSlash = top.indexOf('/', firstSlash + 1);
    int thirdSlash = top.indexOf('/', secondSlash + 1);
    String devId = top.substring(secondSlash + 1, thirdSlash);

    StaticJsonDocument<256> doc;
    DeserializationError err = deserializeJson(doc, message);
    if (!err) {
      const char *act = doc["action"] | "toggle";
      int val = doc["value"] | 1;

      // Bắn lệnh ngay lập tức sang mạng ESP-NOW!
      dispatchCommandToEspNow(devId.c_str(), act, val);
    }
  }
  // 2. Lệnh phát loa thông báo (Intercom): homing/speaker/say
  else if (top == "homing/speaker/say") {
    Serial.printf("[XIAOZHI LOA THÔNG BÁO TỪ WEB]: %s\n", message);

    // Nếu tin nhắn là cảnh báo an ninh hoặc còi báo
    if (strstr(message, "alarm") || strstr(message, "canh_bao") ||
        strstr(message, "alert")) {
      playAlertAlarm();
    } else {
      // Phát chuông báo tin nhắn thoại mới
      playBootChime();
    }
  }
}

// ============================================================================
// KẾT NỐI VÀ RECONNECT MQTT HIVEMQ CLOUD
// ============================================================================
void connectMqtt() {
  if (mqttClient.connected())
    return;

  Serial.print("[MQTT] Dang ket noi HiveMQ Cloud...");
  String clientId = "Homing-Xiaozhi-Gateway-" + String(random(0xffff), HEX);

  if (mqttClient.connect(clientId.c_str(), mqtt_user, mqtt_pass)) {
    Serial.println(" KET NOI THANH CONG!");
    setOledEvent("HiveMQ Connected");

    // Đăng ký nhận lệnh điều khiển từ Web
    mqttClient.subscribe("homing/devices/+/command");
    mqttClient.subscribe("homing/speaker/say");
    mqttClient.subscribe("homing/broadcast/scan");

    // Bắn thông báo Gateway Online
    mqttClient.publish(
        "homing/gateway/state",
        "{\"status\":\"online\",\"protocol\":\"esp-now+wss+i2s_audio\"}", true);
  } else {
    Serial.printf(" That bai, rc=%d. Thu lai sau 5s.\n", mqttClient.state());
  }
}

// ============================================================================
// HÀM XỬ LÝ Ý ĐỊNH TỪ GIỌNG NÓI XIAOZHI (AI CLOUD / LOCAL AGENT)
// ============================================================================
void handleXiaozhiVoiceCommand(const char *deviceId, const char *action) {
  Serial.printf("[XIAOZHI VOICE INTENT] Giong noi ra lenh: %s -> %s\n",
                deviceId, action);
  dispatchCommandToEspNow(deviceId, action, 1);
}

// ============================================================================
// SETUP
// ============================================================================
void setup() {
  Serial.begin(115200);
  delay(500);

  Serial.println("\n========================================================");
  Serial.println("  ESP32 #3: XIAOZHI MASTER GATEWAY (ESP-NOW + MQTT + I2S)");
  Serial.println("========================================================");

  // 1. Khởi tạo màn hình OLED 1.3 inch I2C (SH1106 / SSD1306)
  Wire.begin(OLED_SDA, OLED_SCL);
  u8g2.begin();
  u8g2.clearBuffer();
  u8g2.setFont(u8g2_font_7x14B_tf);
  u8g2.drawStr(6, 14, "XIAOZHI GATEWAY");
  u8g2.drawHLine(0, 18, 128);
  u8g2.setFont(u8g2_font_6x10_tf);
  u8g2.drawStr(2, 34, "Khoi dong he thong...");
  u8g2.drawStr(2, 48, "I2S Audio: Checking");
  u8g2.drawStr(2, 60, "OLED 1.3: Ready");
  u8g2.sendBuffer();

  // 2. Khởi tạo phần cứng Âm thanh I2S (Loa MAX98357A và Micro INMP441)
  initI2S_Speaker();
  initI2S_Microphone();

  // Phát nhạc kiểm tra loa ngay khi cấp nguồn
  playBootChime();

  // Tạo Task FreeRTOS chạy ngầm đọc Micro INMP441 trên Core 1
  xTaskCreatePinnedToCore(micAudioReaderTask, "mic_reader_task", 4096, NULL, 1,
                          &micTaskHandle, 1);

  // 3. Kết nối WiFi gia đình
  setOledEvent("Ket noi WiFi...");
  renderOledDashboard();

  WiFi.mode(WIFI_AP_STA); // Vừa làm Station vừa chạy ESP-NOW
  WiFi.begin(wifi_ssid, wifi_pass);

  Serial.print("Dang ket noi WiFi: ");
  Serial.println(wifi_ssid);

  int timeout = 0;
  while (WiFi.status() != WL_CONNECTED && timeout < 20) {
    delay(500);
    Serial.print(".");
    timeout++;
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nWiFi Da ket noi!");
    Serial.print("IP: ");
    Serial.println(WiFi.localIP());
    Serial.print("Kenh WiFi (Channel): ");
    Serial.println(WiFi.channel());
    setOledEvent("WiFi Da ket noi!");

    // Lấy mã 6 chữ số liên kết với Bot "nhathongminh" trên Xiaozhi Cloud
    fetchXiaozhiActivationCode();
  } else {
    Serial.println("\nChua ket noi duoc WiFi! Vui long kiem tra SSID/Pass.");
    setOledEvent("Loi WiFi!");
  }
  renderOledDashboard();

