NguyenVanHung1707/smart-home-iot-agent/src/firmware/esp32_xiaozhi_gateway/esp32_xiaozhi_gateway.ino
  Serial.print("Dia chi MAC Gateway: ");
  Serial.println(WiFi.macAddress());

  // 4. Khởi tạo ESP-NOW
  if (esp_now_init() != ESP_OK) {
    Serial.println("Loi khoi tao ESP-NOW!");
    setOledEvent("Loi ESP-NOW!");
    renderOledDashboard();
    return;
  }
  Serial.println("ESP-NOW Khoi tao thanh cong!");
  esp_now_register_recv_cb(OnDataRecv);

  // Đăng ký Peer 1: ESP32 Appliances (Thiết bị)
  memcpy(peer1.peer_addr, mac_esp1_appliances, 6);
  peer1.channel = WiFi.channel();
  peer1.encrypt = false;
  esp_now_add_peer(&peer1);

  // Đăng ký Peer 2: ESP32 Entrance (Cổng)
  memcpy(peer2.peer_addr, mac_esp2_entrance, 6);
  peer2.channel = WiFi.channel();
  peer2.encrypt = false;
  esp_now_add_peer(&peer2);

  // 5. Cấu hình MQTT TLS với HiveMQ Cloud
  secureClient.setInsecure(); // Tiết kiệm RAM và kết nối nhanh
  mqttClient.setServer(mqtt_server, mqtt_port);
  mqttClient.setCallback(onMqttMessage);
  mqttClient.setBufferSize(512);

  setOledEvent("San sang hoat dong");
  renderOledDashboard();
}

// ============================================================================
// LOOP
// ============================================================================
void loop() {
  unsigned long now = millis();

  // Duy trì kết nối WiFi và MQTT
  if (WiFi.status() == WL_CONNECTED) {
    if (!mqttClient.connected()) {
      if (now - lastMqttRetry > 5000) {
        lastMqttRetry = now;
        connectMqtt();
      }
    } else {
      mqttClient.loop();
    }
  }

  // Gửi nhịp tim định kỳ mỗi 15 giây
  if (now - lastHeartbeat > 15000) {
    lastHeartbeat = now;
    if (mqttClient.connected()) {
      mqttClient.publish("homing/gateway/heartbeat",
                         "{\"gateway\":\"online\",\"esp_now\":\"active\","
                         "\"audio\":\"i2s_active\"}");
    }
  }

  // Cập nhật màn hình OLED định kỳ (mỗi 2s) hoặc tức thì khi có sự kiện mới
  static unsigned long lastOledRefresh = 0;
  if (!isSpeakerPlaying && (oledNeedsUpdate || (now - lastOledRefresh > 2000))) {
    lastOledRefresh = now;
    oledNeedsUpdate = false;
    renderOledDashboard();
  }
}
